'''
C. Максимальний добуток
Степан останнім часом приділяв мало уваги програмуванню і як, результат, не здав залік. Тепер йому потрібно терміново вирішити наступну задачу:
Дано масив цілих чисел A1, A2, ..., AN, абсолютна величина елементів якого не перевищує 2. Потрібно знайти такий непорожній підвідрізок Al, Al+1, ..., Ar цього масиву (1 ≤ l ≤ r ≤ N), що добуток чисел Al * Al+1 * ... * Ar є максимально можливим.
Звісно, Степан просить у вас допомоги у вирішенні даної задачі.
Вхідні дані:
В першому рядку вхідного файлу знаходиться число N (1 ≤ N ≤ 200 000) — кiлькiсть елементів масиву. В другому рядку знаходиться N цiлих чисел Ai (-2 ≤ Ai ≤ 2) - елементи масиву. 
Вихідні дані:
Єдиний рядок вихідного файлу має містити два числа l і r - знайдені границі оптимального відрізка (1 ≤ l ≤ r ≤ N). Якщо iснує декiлька вiдповiдей, виведiть будь-яку з них.
Система оцінювання:
В даній задачі кожен тест оцінюється окремо.
'''

r = open("input.txt", "r").read().split("\n")
n = int(r[0])
temp = r[1].split(" ")
mass = [int(temp[i]) for i in range(n)]
print(mass)
start = 0
end = 0
dob = {}
max_dob = 1

for i in range(n):
    for j in range(i,n):
        max_dob *= mass[j]
    dob.update({max_dob:[i+1,n]})
    max_dob = 1

print(dob[max(dob)])
        
        

